CBMA/target/classes/ApiRequests/001/CreateAddOccurrenceWorkOrder.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cox="http://webservices.cox.com/Cox.Services.Icoms.CompositeServices">
   <soapenv:Header/>
   <soapenv:Body>
      <cox:createAddOccurrenceWorkOrder>
         <requestHeader>
            <clientIdentifier>webserviceuser</clientIdentifier>
            <user>
               <userName>MACINTPRSI</userName>
               <password>MACINTPRSI</password>
            </user>
         </requestHeader>
         <InstallServicesWorkOrder>
            <SiteId>$SiteID$</SiteId>
            <AccountNumber9>$AccountNumber$</AccountNumber9>
            <Callcode>5</Callcode>
            <SalesmanNumber>99999</SalesmanNumber>
            <EmployeeTypeCode>01</EmployeeTypeCode>
            <ReasonNumber>A9</ReasonNumber>
            <ScheduleType>OFFICEONLY</ScheduleType>
            <UseExternalKey>Y</UseExternalKey>
            <ByPassCreditCheck>Y</ByPassCreditCheck>
            <Telephone>
               <ServiceInfo>$<TelephoneServiceInfo>$</ServiceInfo>
               <ExternalKey>TDM20160510122210</ExternalKey>
               <NewPic>05269</NewPic>
               <PICChangeReason>01</PICChangeReason>
               <FreezePIC>N</FreezePIC>
               <NewLPIC>05269</NewLPIC>
               <LPICChangeReason>01</LPICChangeReason>
               <FreezeLPIC>N</FreezeLPIC>
               <LECFreeze>N</LECFreeze>
               <PortedNonPorted>N</PortedNonPorted>
               <TelephoneNumber>2516227368</TelephoneNumber>
               <DirectoryInfo>
                  <DirectoryType>PRIMARY</DirectoryType>
                  <DirectoryExtKey>01</DirectoryExtKey>
                  <ListingTypeCode>S</ListingTypeCode>
                  <ListType>CLT</ListType>
                  <ListingInstructions>NP</ListingInstructions>
                  <ListingIDCode>A1</ListingIDCode>
                  <FirstName>IPC</FirstName>
                  <LastName>Account</LastName>
                  <ServiceBundle>NP CB</ServiceBundle>
               </DirectoryInfo>
               <CustomerQuestionnaire>
                  <QuestionnaireCode>PORT1</QuestionnaireCode>
                  <CustomerQualified>Y</CustomerQualified>
               </CustomerQuestionnaire>
            </Telephone>
         </InstallServicesWorkOrder>
      </cox:createAddOccurrenceWorkOrder>
   </soapenv:Body>
</soapenv:Envelope>